GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
/*
   SIM卡的IMSI号码为4600 00783208249，
      460 00 18 23 20 86 42

   接口号数据字段的内容为IMSI号码的后12位
   其6个字节的内容为 0x00 0x07 0x83 0x20 0x82 0x49

 */
rt_err_t pt_resp_CIMI( char *p, uint16_t len )
{
	char *pimsi, i;

	rt_kprintf( "cimi len=%d\n", len );
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/*响应CGSN**/
rt_err_t pt_resp_CGSN( char *p, uint16_t len )
{
	char	*pimsi, i;
	char	*pstr;
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/*响应CPIN*/
rt_err_t pt_resp_CPIN( char *p, uint16_t len )
{
	char *pstr=RT_NULL;
	pstr = strstr( p, "+CPIN: READY" ); //+CPIN: READY
	if( pstr )
	{
		return RT_EOK;                  /*找到了*/
	}
	return RT_ERROR;
}

/* +CSQ: 31, 99 */
rt_err_t pt_resp_CSQ( char *p, uint16_t len )
{
	rt_err_t	res = RT_ERROR;
	uint32_t	i, n, code;
	i = sscanf( p, "+CSQ%*[^:]:%d,%d", &n, &code );
	if( i != 2 )
	{
		return RT_ERROR;
	}
	gsm_param.csq = n;
	return RT_EOK;
}

/*+CGATT:1*/
rt_err_t pt_resp_CGATT( char *p, uint16_t len )
{
	char		*pfind = RT_NULL;
	pfind = strstr( p, "+CGATT: 1" );
	if( pfind )	return RT_EOK; 
	return RT_ERROR;
}


/*通用检查函数，看是否收到数据，如果有数据后再判断*/
rt_err_t pt_resp( RESP_FUNC func )
{
	char		*pstr;
	uint16_t	len;
	rt_err_t	ret;
	ret = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pstr, 0 );
	if( ret == -RT_ETIMEOUT )
	{
		return ret;
	}
/*有应答，执行相应的函数*/
	len = ( ( *pstr ) << 8 ) | ( *( pstr + 1 ) );
	ret=func( pstr + 2, len );
	rt_kprintf("pt_resp ret=%x\r\n",ret);
	rt_free( pstr );
	return ret;
}

typedef rt_err_t ( *AT_RESP )( char *p, uint16_t len );
typedef struct
{
	char		*atcmd;
	AT_RESP		resp;
	uint16_t	timeout;
	uint16_t	retry;
}AT_CMD_RESP;



/*上电的处理纤程*/
static int protothread_gsm_poweron( struct pt *pt )
{
	static AT_CMD_RESP at_init[] =
	{
		{ RT_NULL,		   pt_resp_STR_OK, RT_TICK_PER_SECOND * 10, 1  },
		{ RT_NULL,		   pt_resp_STR_OK, RT_TICK_PER_SECOND * 10, 1  },
		{ "ATE0\r\n",	   pt_resp_STR_OK, RT_TICK_PER_SECOND * 3,	1  },
		{ "ATV1\r\n",	   pt_resp_STR_OK, RT_TICK_PER_SECOND * 3,	1  },
		{ "AT+CPIN?\r\n",  pt_resp_CPIN,   RT_TICK_PER_SECOND * 3,	10 },
		{ "AT+CREG?\r\n",  pt_resp_CGREG,  RT_TICK_PER_SECOND * 3,	10 },
		{ "AT+CIMI\r\n",   pt_resp_CIMI,   RT_TICK_PER_SECOND * 3,	1  },
		{ "AT+CGREG?\r\n", pt_resp_CGREG,  RT_TICK_PER_SECOND * 3,	10 },
		{ "AT+CGATT?\r\n", pt_resp_CGATT,  RT_TICK_PER_SECOND * 3,	10	},
	};
	static struct timer	timer_gsm_poweron;
	static uint8_t	at_init_index	= 0;
	static uint8_t	at_init_retry	= 0;
	rt_err_t ret;
	
	PT_BEGIN( pt );
	if( gsm_state == GSM_POWERON )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		timer_set( &timer_gsm_poweron, 200 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_poweron ) );
		GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );

		for( at_init_index = 0; at_init_index < sizeof(at_init)/sizeof(AT_CMD_RESP); at_init_index++ )
		{
			for( at_init_retry = 0; at_init_retry < at_init[at_init_index].retry; at_init_retry++ )
			{
				if( at_init[at_init_index].atcmd != RT_NULL )
				{
					rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), at_init[at_init_index].atcmd );
					m66_write( &dev_gsm, 0, at_init[at_init_index].atcmd, strlen( at_init[at_init_index].atcmd ) );
				}
				timer_set( &timer_gsm_poweron, at_init[at_init_index].timeout );
				PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_poweron ) || ( RT_EOK == pt_resp( at_init[at_init_index].resp ) ) );
				if( timer_expired( &timer_gsm_poweron ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
				}
				else
				{
					break;
				}
			}
		}
		gsm_state = GSM_AT; /*切换到AT状态*/		
	}
	PT_END( pt );
	
}

/*关机的处理纤程*/
static int protothread_gsm_poweroff( struct pt *pt )
{
	struct timer	timer_gsm_poweroff;
	PT_BEGIN( pt );

	PT_END( pt );
}

/*线程状态处理,可以yield*/
char				dialstr[64];
static AT_CMD_RESP	at_tcpip[] =
{
	{ dialstr,				 pt_resp_STR_OK, RT_TICK_PER_SECOND * 5, 1 },
	{ "AT%ETCPIP\r\n",		 pt_resp_STR_OK, RT_TICK_PER_SECOND * 3, 1 },
	{ "AT%IOMODE=1,2,1\r\n", pt_resp_STR_OK, RT_TICK_PER_SECOND * 3, 1 },
};
static uint8_t		at_tcpip_index = 0;


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static int protothread_gsm_socket( struct pt *pt )
{
	PT_BEGIN( pt );
	if( ( gsm_state == GSM_AT ) && ( socket_state == SOCKET_TCPIP_INIT ) )
	{
		for( at_tcpip_index = 0; at_tcpip_index < 6; at_tcpip_index++ )
		{
			if( at_tcpip[at_tcpip_index].atcmd != RT_NULL )
			{
				rt_kprintf( "gsm_send>%s", at_tcpip[at_tcpip_index].atcmd );
				m66_write( &dev_gsm, 0, at_tcpip[at_tcpip_index].atcmd, strlen( at_tcpip[at_tcpip_index].atcmd ) );
			}
			timer_set( &timer_gsm_tcpip, at_tcpip[at_tcpip_index].timeout );
			PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_tcpip ) || ( RT_EOK == pt_resp( at_tcpip[at_tcpip_index].resp ) ) );
			if( !timer_expired( &timer_gsm_tcpip ) ) /*超时*/
			{
				rt_kprintf( "not receive ok\r\n" );
				PT_EXIT( pt );
			}
		}
	}
#if 0
	/*查询链接状态*/
	if( socket_state == SOCKET_READY )
	{
		for( i = 0; i < MAX_SOCKET_NUM; i++ )
		{
			if( gsm_socket[i].connect_state == 1 )
			{
			}
		}
	}
#endif
	/*确认dns结果*/
//	rt_thread_delay( RT_TICK_PER_SECOND / 10 );

	PT_END( pt );
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[512];
struct rt_thread thread_gsm;


/***********************************************************
* Function:       rt_thread_entry_gsm
* Description:    接收处理，状态转换
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	ch;

	PT_INIT( &pt_gsm_poweron );
	//PT_INIT(&pt_gsm_poweroff);

	while( 1 )
	{
		protothread_gsm_poweron( &pt_gsm_poweron );
		//protothread_gsm_poweroff(&pt_gsm_poweroff);
/*接收超时判断*/

		while( rt_ringbuffer_getchar( &rb_uart4_rx, &ch ) == 1 ) /*有数据时，保存数据*/
		{
			gsm_rx[gsm_rx_wr++] = ch;
			if( gsm_rx_wr == GSM_RX_SIZE )
			{
				gsm_rx_wr = 0;
			}
			gsm_rx[gsm_rx_wr] = 0;
		}
		if( rt_tick_get( ) - last_tick > RT_TICK_PER_SECOND / 10 )  //等待100ms,实际上就是变长的延时,最迟100ms处理完一个数据包
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( gsm_rx, gsm_rx_wr );                      /*接收信息的处理函数*/
				gsm_rx_wr = 0;
			}
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( void )
{
	rt_thread_t tid;

/*初始化串口接收缓冲区*/
	rt_ringbuffer_init( &rb_uart4_rx, uart4_rxbuf, UART4_RX_SIZE );

	rt_mb_init( &mb_gsmrx, "gsm_rx", &mb_gsmrx_pool, MB_GSMRX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

	dev_gsm.type	= RT_Device_Class_Char;
	dev_gsm.init	= m66_init;
	dev_gsm.open	= m66_open;
	dev_gsm.close	= m66_close;
	dev_gsm.read	= m66_read;
	dev_gsm.write	= m66_write;
	dev_gsm.control = m66_control;

	rt_device_register( &dev_gsm, "gsm", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_gsm );
}

